getopenmono/arduino_comp/mono/boards.txt
mono.name=Mono
mono.vid.0=0xF232
mono.pid.0=0x04B4
mono.upload.tool=monoprog
mono.upload.protocol=mono-prog
mono.upload.maximum_size=262144
mono.upload.use_1200bps_touch=false
mono.build.mcu=cortex-m3
mono.build.f_cpu=84000000L
mono.build.usb_product="Mono"
mono.build.board=MONO
mono.build.core=arduino
mono.build.extra_flags=-D__MONO__
mono.build.ldscript={runtime.platform.path}/cores/arduino/mono/include/mbed/target_cypress/cm3gcc.ld
#arduino_due_x.build.variant=arduino_due_x
#arduino_due_x.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
#arduino_due_x.build.vid=0x2341
#arduino_due_x.build.pid=0x003e

